emacs/dired-mode/operating-on-files.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Operating on Files</title>
<!-- 2018-01-24 수 11:01 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
</head>
<body>
<div id="content">
<h1 class="title">Operating on Files</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Ref</a></li>
</ul>
</div>
</div>
<p>
This section describes the basic Dired commands to operate on one file or several files. All of these commands are <b>capital letters</b>; all of them use the minibuffer, either to read an argument or to ask for confirmation, before they act. All of them let you specify the files to manipulate in these ways:
</p>
<ul class="org-ul">
<li>If you give the command a numeric pefix arguement <i>n</i>, it operate on the next <i>n</i> files, starting with the current file. (If <i>n</i> is negative, the command operates on the -n files peceding the current line.)
</li>
<li>Otherwise, if some files are marked with '*', the command operates on all those files.
</li>
<li>Otherwise, the command operates on the current file only. 
</li>
</ul>

<p>
Certain other Dired commands, such as ! and the '%' commands, use the same conventions to decide which files to work on. 
</p>

<p>
Commands which ask for a destination directory, such as those which copy and rename files or create links for them, try to guess the default target directory for the operation. Normally, they suggest the Dired buffer's default directory, but if the variable dired-dwim-target is non-nil, and if there is another Dired buffer displayed in the next windows, that other buffer's directory is suggested instead. 
</p>

<p>
Here are the file-manipulating Dired commands that operate on files. 
</p>

<p>
<b>C <i>new</i> &lt;RET&gt;</b>
</p>
<p class="verse">
Copy the specified files (dired-do-copy). The argument <i>new</i> is the directory to copy info, or (if copying a single file) the new name. This is like the shell command <b>cp</b>.<br  />
<br  />
If dired-copy-preserve-time is non-nil, then copying with this command preserves the modification time of the old file in the copy, like 'cp -p'.<br  />
<br  />
The variable direc-recursive-copies controls whether to copy directories recursively (like 'cp -r'). The default is top, which means to ask before recursively copying a directory.<br  />
</p>

<p>
<b>D</b>
</p>
<p class="verse">
Delete the specified files (dired-do-delete). This is like the shell command rm.<br  />
</p>

<p>
<b>R <i>new</i> &lt;RET&gt;</b>
</p>
<p class="verse">
Rename the specified files (dired-do-rename). If you rename a single file, the arguement <i>new</i> is the new name of the file. If you rename several files, the argment <i>new</i> is the directory into which to move the files (this is like the shell command mv).<br  />
<br  />
Dired autumatically changes the visited file name of buffers associfated with renamed file so that they refer to the new names.<br  />
</p>







<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Ref</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="https://www.gnu.org/software/emacs/manual/html_node/emacs/Operating-on-Files.html">https://www.gnu.org/software/emacs/manual/html_node/emacs/Operating-on-Files.html</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2018-01-24 수 11:01</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
